## **Librerías**

In [1]:
import pandas as pd
import numpy as np

## **Código**

#### **Convertir una lista en diccionario**

In [2]:
lista = ['A', 'A', 'B', 'C', 'C', 'C']

In [3]:
# La convertimos en una seria, aplicamos una función para contar los valores distintos y la convertimos en diccionario
pd.Series(lista).value_counts().to_dict()

{'C': 3, 'A': 2, 'B': 1}

#### **Expandir los valores de una lista para que cada elemento se vuelva un registro**

In [4]:
df = pd.DataFrame({
    'Key': ['A', 'B'],
    'Data': [[1, 3, 4], [1, 8]]
})

In [5]:
df.explode(column='Data').reset_index(drop=True)

  Key Data
0   A    1
1   A    3
2   A    4
3   B    1
4   B    8

#### **Remplazar valores faltantes con datos de otras columnas**

In [6]:
df = pd.DataFrame(
    {
        "A": [None, 0, 12, 5, None], 
        "B": [3, 4, 1, None, 11]
    }
)

In [7]:
df

      A     B
0   NaN   3.0
1   0.0   4.0
2  12.0   1.0
3   5.0   NaN
4   NaN  11.0

In [8]:
df['A'] = df['A'].combine_first(df['B'])

In [9]:
df

      A     B
0   3.0   3.0
1   0.0   4.0
2  12.0   1.0
3   5.0   NaN
4  11.0  11.0

#### **Suma acumulada con un groupby**

In [12]:
df = pd.DataFrame({
    'Category' : ['A', 'A', 'A', 'B', 'B', 'C'],
    'Value_1': [1, 4, 6, 2, 8 , 5],
    'Value_2': [6, 4, 6, 9, 9, 0],
})

In [21]:
df['Acumulado_1'] = df[['Value_1', 'Category']].groupby('Category').cumsum()
df['Acumulado_2'] = df[['Value_2', 'Category']].groupby('Category').cumsum()

In [22]:
df

  Category  Value_1  Value_2  Acumulado_1  Acumulado_2
0        A        1        6            1            6
1        A        4        4            5           10
2        A        6        6           11           16
3        B        2        9            2            9
4        B        8        9           10           18
5        C        5        0            5            0

#### **Calculando el cambio porcentual**

In [77]:
df['Cambio_%'] = df['Value_1'].pct_change()
df

  Category  Value_1  Value_2  Acumulado_1  Acumulado_2  Condicional  Cambio_%
0        A        1        6            1            6            6       NaN
1        A        4        4            5           10           10  3.000000
2        A        6        6           11           16           16  0.500000
3        B        2        9            2            9            9 -0.666667
4        B        8        9           10           18           18  3.000000
5        C        5        0            5            0            1 -0.375000